<a href="https://colab.research.google.com/github/Keiji2827/data_scientist/blob/master/Chapter8_ver2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 8 データベースとSQLの基礎

- **[8.1 この章の概要](#8.1-この章の概要)**
    - [8.1.1 データベースとは](#8.1.1-データベースとは)
    - [8.1.2 RDBMS](#8.1.2-RDBMS)
<br><br>
- **[8.2 SQLの基礎](#8.2-SQLの基礎)** 
    - [8.2.1 データベースとテーブルの作成](#8.2.1-データベースとテーブルの作成)
    - [8.2.2 データの検索と更新、削除、テーブルカラムの変更](#8.2.2-データの検索と更新、削除、テーブルカラムの変更)
    - [8.2.3 データの集計、演算、並び替え](#8.2.3-データの集計、演算、並び替え)
    - [8.2.4 グループごとの集計](#8.2.4-グループごとの集計)
    - [8.2.5 複数テーブルの利用](#8.2.5-複数テーブルの利用)
    - [8.2.6 case文とサブクエリ](#8.2.6-case文とサブクエリ)
<br><br> 
- **[8.3 ビュー](#8.3-ビュー)** 
    - [8.3.1 ビュー](#8.3.1-ビュー)
<br><br>
- **[8.4 総合問題](#8.4-総合問題)**
    - [8.4.1 総合問題1](#8.4.1-総合問題1)
    - [8.4.2 総合問題2](#8.4.2-総合問題2)

## 8.1 この章の概要
ゴール：データベースの役割を知る

### 8.1.1 データベースとは
キーワード：データベース、RDBMS

ここからはデータベースについて学んでいきます。データベースとは、簡単にいいますと、コンピューターを利用して膨大なデータをまとめて、後から色々なニーズに対して活用できるように、管理されたデータの集まりのことです。データベースには、たくさんのテーブルがあり、そのテーブルの中にデータがあります。以下が、データベースとテーブルのイメージ図です。なお、テーブルの行をレコードといい、列をカラムといいます。

![comment](http://www.webolve.com/image/basic/aboutdb/fig_02.jpg)

参照URL：http://www.webolve.com/image/basic/aboutdb/fig_02.jpg

具体的なデータとしては、ある店舗の毎日の売り上げをデータベースで管理していることもありますし、顧客の個人情報、社員の給料情報、金融の取引データ、ウェブサイトのアクセスログデータ等もデータベースで管理されたりしています。購買データでいうと、売れた商品の日時、その商品を識別するコード、購買者、その商品の値段、数量などがデータとしてテーブルに入ってきます。これらのデータは日々追加されますし、何かの集計（1ヶ月の売り上げの計算など）をするときはデータベースからデータが抽出され、必要なければ削除されます。

それでは、そもそも何故データベースが必要なのでしょうか。小さなデータで、一貫性等を求められていなければ、Excelで十分かもしれません。しかし、データは日々大きくなっていきますし、昨今は特にIoTなどが注目されており、リアルタイムに膨大な量のデータが生まれています。ビッグデータと言われる現代、データソースのテーブルに1億レコード以上あるということもしばしばあり、これをExcelで集計することは困難でしょう。データベースとそれを呼び出すためのSQLという言語を使うことで、大きなデータに対しても効率的に作業ができるのです。（ただし、昨今はビッグデータを扱う際にHadoopやSparkなどの分散処理をするソフトウェアなどが使われるようになっており、この講座でも後半の章で少し触れます。）

さらに管理するという視点でも、Excelでは限界があります。Excelは基本的に誰でも編集ができますし、後からデータに問題があった場合に対処するのが困難です。列も自由に異なるデータを入力できますし、それを統一的に扱うのは難しいです。データベースを使うことで、容易に管理できます。なお、同時にデータを変更することを避けるために、データにロックをかけて、他の人が編集できないようにすることを**「排他制御」**といい、以下のようなイメージ図になります。


![](http://image.itmedia.co.jp/ait/articles/1105/30/r501-01.gif)

参照URL：http://image.itmedia.co.jp/ait/articles/1105/30/r501-01.gif

### 8.1.2 RDBMS
キーワード：RDMBS、MySQL、テーブル

この章で学ぶデータベースのシステムは、RDBMSと言われるリレーショナルデータベースを管理するシステムです。代表的な製品に、Oracle, Microsoft SQL Server, PostgreSQL, MySQLなどがあります。ここでは、MariaDBというデータベースを使用します。以下は、データベースのイメージです。

![comment](https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif)

参照URL：https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif

データベースにはテーブルがあり、データはそのテーブルから抽出します。テーブルは幾つかのカラム（列）から構成され、それぞれ型の異なるデータが入っています。数値型であったり、文字であったり、日時であったりします。Excelでは、同じ列に数字や文字など、色々な型のデータを混在して入れることができますが、データベースのテーブルには同じ型を指定してデータを入れる必要があります。データがそのような状態なので、後で集計がとても簡単にできます。それらの扱い方についても、後で学びます。

ここでデータベースに関する簡単な紹介は終わります。他にも色々な概念がありますが、まずはデータをハンドリングできるように、実装中心に学んでいきましょう。SQLもまた手を動かしながら学ぶことで、早く使えるようになります。

なお、以下の参考文献が初心者にはわかりやすいので、全くSQLの経験がない方は前半のみ一読をおすすめします。一部、PHPとその連携もありますが、この講座を理解するためには必要ありません。適宜、興味があれば学習してください。

>[参考文献]

>『基礎からのMySQL 改訂版 (基礎からシリーズ) 』（西沢 夢路 (著)、 SBクリエイティブ）

## 8.2 SQLの基礎
ゴール：SQLの基礎的な操作方法を身につける

### 8.2.1 データベースとテーブルの作成
キーワード：データベース作成、テーブル、show databases,use,show tables, create, select,

早速、今あるデータベースにどんなものがあるのか見ていきましょう。以下のshow databases;でデータベースを表示することができます。（なお、本章と次の章はSQLでの実行を中心としますので、ここで練習されるのはSQLのみにしてください。Pythonは基本的に実行できません。もし実行したい場合は、Pythonの章で練習しましょう。ただし、カーネルを変更することでPythonは実行可能です。）

** 注意：現在、JupyterLabからそのまま開いたiPython notebookでは使うことはできないため、本章と次章に関してはトップ画面にあるHelp->Launch Classic Notebook をクリックして、旧版のnotebookで実行してください。**

** 注意：以下、練習問題も含め、可能な限り上から実行するようにしてください。あとの問題で使います。**

In [0]:
show databases;

,Database
0,information_schema
1,mysql
2,performance_schema

ここに、新しいデータベースを追加してみましょう。create databaseを使い、その後に、データベース名を決めて実行します。ここでは、TEST1という名前にしています。

In [0]:
create database TEST1;

作ったデータベースがあるか確認してみましょう。先ほど追加したTEST1というデータベースが追加されていることがわかります。

In [0]:
show databases;

,Database
0,TEST1
1,information_schema
2,mysql
3,performance_schema

useを実行することで、これから使うデータベースを選択します。show tablesで今選択しているデータベースのテーブル一覧を表示させることができます。ここに使うテーブルを作成していきますが、まだ空です。

In [0]:
use TEST1;
show tables;

ここにデータベースを作成していきます。テーブルにデータが入り、データのカラム名とその型を指定します。実際にテーブルを作ってみましょう。以下のようにcreate tableを実行しますが、要注意です。最初にテーブル名、データの型と名前等を付けています。ここではmeiboテーブルに整数型のid、文字型のnameを設定しています。さらに、primary keyというのは、このカラムが一意のキーとなっていることを宣言しています。つまり、同じデータは入らないということです。

In [0]:
create table meibo
  (id int primary key, name varchar(20))
  engine = MyISAM
  default charset = utf8;

もう一度、テーブルがあるかどうか確認しましょう。

In [0]:
show tables;

,Tables_in_TEST1
0,meibo

さて、ここでテーブルからデータを引っ張る時に、以下のようにselect * from テーブル名という書き方をします。アスタリスクは、すべての列名を持ってくるという意味です。ただ、以下のselect文を実行しても、空のテーブルだけなので、中身は何もなく、空のレコードが表示されます。

In [0]:
select * from meibo;

用意したテーブルに、データを挿入してみましょう。データの挿入はinsert into を使います。その後に、「テーブル名（カラム名）values 挿入したいデータ」で実行します。以下のように記述して、データを3レコード挿入しています。

In [0]:
insert into meibo (id, name) values (1, "Yamada");
insert into meibo (id, name) values (2, "Tanaka");
insert into meibo (id, name) values (3, "Sato");

もう一度、テーブルを確認してみましょう。

In [0]:
select * from meibo;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Sato

なお、同じキーとなるidのデータを入れるとエラーが出て、以下のようになります。

In [0]:
insert into meibo (id, name) values (1, "Yamada");

Traceback (most recent call last):
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 50, in do_execute
    html = self.execute_sql(code)
  File "/opt/conda/lib/python3.6/site-packages/mysql_kernel.py", line 71, in execute_sql
    for sub_cursor in self.cursor.execute(sql, multi=True):
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/cursor.py", line 494, in _execute_iter
    result = next(query_iter)
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 526, in cmd_query_iter
    yield self._handle_result(self._send_cmd(ServerCmd.QUERY, statements))
  File "/opt/conda/lib/python3.6/site-packages/mysql/connector/connection.py", line 396, in _handle_result
    raise errors.get_exception(packet)
mysql.connector.errors.IntegrityError: 1062 (23000): Duplicate entry '1' for key 'PRIMARY'

>**[ポイント]**

>show databases：データベースの一覧表示

>use [データベース名]：データベースの選択

>create databases [データベース名]：データベースの作成

>create table [テーブル名] [カラム名 型]：テーブルの作成

>create table [テーブル名] [カラム名 型] primary key：プライマリーキーの設定

>select * from テーブル名：テーブル名のカラムすべてのデータを問い合わせ

>instert into [テーブル名] [カラム名 型] [値]：データの挿入

#### <練習問題 1>

セルを追加（左上にある＋を押下）して、今あるデータベースを表示させましょう。そして、新しいデータベース（TEST2など）を作って、そのデータベースを使うように選択しましょう。

#### <練習問題 2>

練習問題１で作成、選択したデータベースに新しいテーブル「meibo2」を作成してください。作成後はテーブルが完成しているか、確認しましょう。

#### <練習問題 3>

新しく作ったテーブルにデータを追加してみましょう。追加後は、確かにデータが入っているか確認してください。

### 8.2.2 データの検索と更新、削除、テーブルカラムの変更
キーワード：where, in, like, update, delete, alter

次は、データの抽出をするときに、条件を絞って実行してみましょう。条件はwhere文を使います。以下では、id=2の人のデータを抽出しています。<br>注：上記の練習問題を解いた後は、参照しているデータベースが異なるので、データベースTEST1を再選択しましょう。

In [0]:
/*データベースの選択*/
use TEST1;

In [0]:
select * from meibo where id=2;

,id,name
0,2,Tanaka

次は、テーブルにidが1か2かどちらかあるときです。inを使っています。（他、データの範囲を絞り込むためbetweenなどもありますので、調べてみてください。）

In [0]:
select * from meibo where id in (1,2);

,id,name
0,1,Yamada
1,2,Tanaka

以下のような記述で、曖昧検索もできます。likeを使って、以下の処理では、Sからはじまって後は任意の文字列ということで、「S%」としています。他にも、「%S」や「%S%」で検索が可能です。

In [0]:
select * from meibo where name like 'S%';

,id,name
0,3,Sato

>**[やってみよう]**

>上の条件式を色々と変更してデータを検索してみましょう。例えば、idが1以外の人や、nameがaで終わる人はどのように検索しますか？

今までは存在してるデータを抽出してきましたが、次は、データを変更してみます。updateを使って、id=3の人を更新してみます。記述方法は以下のようになります。

In [0]:
update meibo
 set name = "Suzuki"
 where id=3;

更新されているか確かめてみましょう。

In [0]:
select * from meibo;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki

データを削除する場合も扱いましょう。データを用意(id=4)して、確認します。

In [0]:
insert into meibo (id, name) values (4, "Dummy");
select * from meibo;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki
3,4,Dummy

データの削除はdeleteを使います。ここでは、先ほど用意しましたid＝4の人を削除します。

In [0]:
delete from meibo
where id = 4;

念のため、消えているかどうか確認しましょう。

In [0]:
select * from meibo;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki

次は、新しいカラムを追加しましょう。その人のクラスと年齢を追加します。「alter table テーブル名 add 新しいカラム名 型」です。

In [0]:
alter table meibo add class int;
alter table meibo add age int;

新しくカラムを追加したテーブルをチェックしてみましょう。classとageには、まだ何もデータは入っていないので、NULLになります。  
教材の仕様でNoneと表示されていますが、実体はNULLです。

In [0]:
select * from meibo;

,id,name,class,age
0,1,Yamada,None,None
1,2,Tanaka,None,None
2,3,Suzuki,None,None

updateを使ってデータを更新します。

In [0]:
update meibo
 set class=1,age=13
 where id=3;

id=3の人のにクラスと年齢のデータが入りました。

In [0]:
select * from meibo;

,id,name,class,age
0,1,Yamada,None,None
1,2,Tanaka,None,None
2,3,Suzuki,1,13

続けて、他の人のデータも更新しましょう。

In [0]:
update meibo
 set class=1,age=14
 where id=1;
 
update meibo
 set class=2,age=13
 where id=2;

In [0]:
select * from meibo;

,id,name,class,age
0,1,Yamada,1,14
1,2,Tanaka,2,13
2,3,Suzuki,1,13

新しい人たちのデータを追加しましょう。先ほどはinsertを1つ1つ実行していきました。ここでは、以下のコマンドで一度に更新します。

In [0]:
insert into meibo (id,name,class,age) 
 values (4,"Kato",2,15),(5,"Ito",3,12),(6,"Takeuchi",2,16),(7,"Kimura",3,11),(8,"Sato",1,14);

データの確認をします。

In [0]:
select * from meibo;

,id,name,class,age
0,1,Yamada,1,14
1,2,Tanaka,2,13
2,3,Suzuki,1,13
3,4,Kato,2,15
4,5,Ito,3,12
5,6,Takeuchi,2,16
6,7,Kimura,3,11
7,8,Sato,1,14

>**[ポイント]**

>select * from [テーブル名] where 条件：条件でデータを絞り込み

>in：条件マッチ

>like：曖昧検索

>delete from [テーブル名]：データの削除（注：条件を絞りこむ場合はwhere文を追加する）

>alter table [テーブル名] add [カラム名 型]:テーブルのカラム名追加

>update [テーブル名] set ：データのアップデート

#### <練習問題 1>

TEST1のデータベースを選択して、上記のテーブルmeiboにて、id=4の人レコードを抽出してください。

#### <練習問題 2>

上のmeiboテーブルでid=8の人のclassを7にアップデートしてください。select文でアップデートを確認できたら、id=8の人のclassを1に戻してください。

#### <練習問題 3>　(※必須問題：以降の問題で使います。)

上記と同じテーブルmeiboに新しい列heightという身長を追加してください。さらに、id=1から4までの人は150、id=5から6までの人は155、id=7から8までの人は160でアップデートしてください。

### 8.2.3 データの集計、演算、並び替え
キーワード：count,distinct,order,avg,sum,limit

次は、SQLを使った集計になります。データを見るときにまず気になるのが、何レコードあるかということです。以下で、データが何行あるかカウントするために、countを使っています。

In [0]:
use TEST1

In [0]:
select count(*) from meibo;

,count(*)
0,8

なお、asで名前をつけることができます。エイリアスといいます。cntというカラム名をつけてみましょう。

In [0]:
select count(*) as cnt from meibo;

,cnt
0,8

次は、このcountを使って、異なる種類のデータを数えてみます。具体的には、先ほどレコード数は8レコードありましたが、異なるクラスは何クラスあるでしょうか。countとdistinct を併用することで、重複を除いた件数をカウントできます。

In [0]:
select count(distinct class) as classCnt from meibo;

,classCnt
0,3

次は、平均を計算します。以下は、平均年齢を計算しています。avgを使います。

In [0]:
select avg(age) as avgAge from meibo;

,avgAge
0,13.5000

なお、sum関数を使うと合計されますが、年齢の合計の用途はあまりなさそうです。ここでは、先ほどのcountと組み合わせて、平均年齢を算出しましょう。上記の結果と同じになっていることがわかります。このように、selectの中で演算が可能です。

In [0]:
select sum(age) / count(*) as avgAge from meibo;

,avgAge
0,13.5000

年齢最大値と最小値は以下のように記述します。最年少が11歳、最年長が16歳とわかります。

In [0]:
select min(age) as minAge, max(age) as maxAge from meibo;

,minAge,maxAge
0,11,16

次は、idを軸として降順に並べてみましょう。並び替えはorder by カラム名を使います。descをつけることで、降順（大きいものから小さいものの順番）になります。

In [0]:
select * from meibo order by id desc;

,id,name,class,age,height
0,8,Sato,1,14,160
1,7,Kimura,3,11,160
2,6,Takeuchi,2,16,155
3,5,Ito,3,12,155
4,4,Kato,2,15,150
5,3,Suzuki,1,13,150
6,2,Tanaka,2,13,150
7,1,Yamada,1,14,150

今度は、ageを軸として昇順（小さいものから大きいものの順番）に並べてみましょう。デフォルトは昇順です。

In [0]:
select * from meibo order by age;

,id,name,class,age,height
0,7,Kimura,3,11,160
1,5,Ito,3,12,155
2,2,Tanaka,2,13,150
3,3,Suzuki,1,13,150
4,1,Yamada,1,14,150
5,8,Sato,1,14,160
6,4,Kato,2,15,150
7,6,Takeuchi,2,16,155

class,ageの2つの軸で昇順に並べてみましょう。なお、優先順位は先に記述したカラムになります。この場合は、classです。

In [0]:
select * from meibo order by class,age;

,id,name,class,age,height
0,3,Suzuki,1,13,150
1,1,Yamada,1,14,150
2,8,Sato,1,14,160
3,2,Tanaka,2,13,150
4,4,Kato,2,15,150
5,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160
7,5,Ito,3,12,155

limitを使うと行数の制限ができます。数多くのデータがありそうなときは、limitを使ってデータを確認しましょう。

In [0]:
select * from meibo limit 3;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150

次は、複数条件での絞り込みです。同時条件で絞り込む場合はandを使います。

In [0]:
select * from meibo where class=2 and age>=15;

,id,name,class,age,height
0,4,Kato,2,15,150
1,6,Takeuchi,2,16,155

次は、or です。どちらか片方の条件を満たすものを絞り込む場合に使います。

In [0]:
select * from meibo where class=1 or age>=15;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,3,Suzuki,1,13,150
2,4,Kato,2,15,150
3,6,Takeuchi,2,16,155
4,8,Sato,1,14,160

>**[ポイント]**

>count：レコードのカウント

>as：エイリアス（名前をつける）

>distinct ：重複なく区別する

>avg ：平均値

>max ：最大値

>min ：最小値

>order by カラム名：昇順に並び替え（降順はカラム名の後にdesc）

#### <練習問題 1>
上記と同じmeiboテーブルで、異なる年齢は何種類でしょうか。

#### <練習問題 2>
身長が一番小さい人、大きい人の身長をそれぞれ求めてください。

#### <練習問題 3>
身長が155以上で、classが3のレコードを抽出してください。

### 8.2.4 グループごとの集計
キーワード：group by, having

次は、SQLを使ってグループごとに集計してみましょう。似ているのはExcelのピボットテーブルの機能です。ここではクラスを軸にしてみます。次のコマンドは各クラスの人数を数えています。

In [0]:
select class, count(*) as num from meibo group by class;

,class,num
0,1,3
1,2,3
2,3,2

平均を各グループごとに算出することも可能です。最小値、最大値も同様に算出できます。

In [0]:
select class, count(*) as num, avg(age) as avgAge from meibo group by class;

,class,num,avgAge
0,1,3,13.6667
1,2,3,14.6667
2,3,2,11.5000

さらに条件付きで表示してみましょう。having を使っています。

In [0]:
select class, avg(age) as avgAge from meibo group by class having avgAge>13;

,class,avgAge
0,1,13.6667
1,2,14.6667

whereと組み合わせることもできます。

In [0]:
select class, avg(age) as avgAge from meibo where age > 13 group by class;

,class,avgAge
0,1,14.0000
1,2,15.5000

whereとhavingはどちらも条件を絞っているのですが、whereはselectで抽出された中から条件を絞っていますが、havingはgroup byでグループ化した結果から条件を絞っています。

次は、2つの軸を使った集計です。クラス×年齢でレコード数をカウントしています。

In [0]:
select class, age, count(*) as num from meibo group by class,age;

,class,age,num
0,1,13,1
1,1,14,2
2,2,13,1
3,2,15,1
4,2,16,1
5,3,11,1
6,3,12,1

番号（順）で指定して集計することも可能です。なお、group by は以下のように、呼び出している列の番号で指定することもできます。ただし、わからなくなる可能性がありますので、簡易集計以外のときにはカラム名を指定することをおすすめします。

In [0]:
select class, age, count(*) as num from meibo group by 1,2;

,class,age,num
0,1,13,1
1,1,14,2
2,2,13,1
3,2,15,1
4,2,16,1
5,3,11,1
6,3,12,1

>**[ポイント]**

>group by：軸を設定

>having：条件設定

#### <練習問題 1>

meiboテーブルにてクラスごとの平均身長を求めてみましょう。

#### <練習問題 2>

上に加えて、クラスごとの人数、一番小さい人と、一番大きな人の身長もそれぞれのクラスで算出しましょう。

#### <練習問題 3>

年齢が13歳より上の人に絞って、上記と同じ項目を求めてください。

### 8.2.5 複数テーブルの利用
キーワード：union,union all, inner join, outer join,内部結合、外部結合、自己結合

次は複数のテーブルを使って、データを操作してみましょう。準備のため、テーブルを作成します。テーブルの作成は以前に学んだ方法でも作成できますが、再び作成するのは面倒なので、すでに作成したテーブルを「コピー」しましょう。以下のように create で新規に作成するテーブル名を指定した後、"like コピー元のテーブル名" とつづけることでテーブル構造を丸ごとコピーできます。

In [0]:
/*前のテーブルは使わないので、一旦削除します*/
drop table if exists meibo2;

In [0]:
create table meibo2 like meibo;

確認してみましょう。テーブルの構造をチェックするときは、descを使います。

In [0]:
/*テーブル*/
desc meibo2;

/*データの確認*/
select * from  meibo2;

データを追加します。なお、１行目はわざとmeiboにある同じデータ（Yamada）を入れています。結果を確認してみてください。

In [0]:
insert into meibo2 (id,name,class,age,height) 
 values (1,"Yamada",1,14,150),
        (9,"Nagata",4,11,160),
        (10,"Sugino",2,13,150),
        (11,"Takayama",1,14,155),
        (12,"John",3,16,165);

In [0]:
select * from  meibo2;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,9,Nagata,4,11,160
2,10,Sugino,2,13,150
3,11,Takayama,1,14,155
4,12,John,3,16,165

データを結合してみましょう。unionを使います。なお、unionは重複レコードは省きますが、union allは重複も許容します。id=1の人がunion allの場合2レコードあるのがわかります。

In [0]:
select * from  meibo
union
select * from  meibo2;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150
3,4,Kato,2,15,150
4,5,Ito,3,12,155
5,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160
7,8,Sato,1,14,160
8,9,Nagata,4,11,160
9,10,Sugino,2,13,150
10,11,Takayama,1,14,155
11,12,John,3,16,165

In [0]:
select * from  meibo
union all
select * from  meibo2;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150
3,4,Kato,2,15,150
4,5,Ito,3,12,155
5,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160
7,8,Sato,1,14,160
8,1,Yamada,1,14,150
9,9,Nagata,4,11,160
10,10,Sugino,2,13,150
11,11,Takayama,1,14,155
12,12,John,3,16,165

テストのスコアテーブルを作成して、このmeiboテーブルと結合してみましょう。

In [0]:
create table score
  (id int primary key, math int, english int,science int)
  engine = MyISAM
  default charset = utf8;

In [0]:
desc score;

,Field,Type,Null,Key,Default,Extra
0,id,int(11),NO,PRI,None,
1,math,int(11),YES,,None,
2,english,int(11),YES,,None,
3,science,int(11),YES,,None,

scoreテーブルにサンプルデータを挿入します。

In [0]:
insert into score (id,math,english,science) 
 values (1,10,10,40),(2,NULL,60,100),(3,30,40,60),
        (5,25,31,10),(6,50,30,10),(8,90,100,90),
        (9,67,71,50),(11,100,40,88),(15,76,21,13);

念のためデータが入っているかどうか確認します。

In [0]:
select * from score;

,id,math,english,science
0,1,10,10,40
1,2,None,60,100
2,3,30,40,60
3,5,25,31,10
4,6,50,30,10
5,8,90,100,90
6,9,67,71,50
7,11,100,40,88
8,15,76,21,13

以下でidをキーに内部結合しています。テーブル名の後に別名を簡単に付けて（meibo はa、scoreはb）います。

In [0]:
select * from meibo a join score b on a.id=b.id;

,id,name,class,age,height,id,math,english,science
0,1,Yamada,1,14,150,1,10,10,40
1,2,Tanaka,2,13,150,2,None,60,100
2,3,Suzuki,1,13,150,3,30,40,60
3,5,Ito,3,12,155,5,25,31,10
4,6,Takeuchi,2,16,155,6,50,30,10
5,8,Sato,1,14,160,8,90,100,90

idをキーに外部結合(左)しています。左にあるテーブルがベースになります。右にデータがいない場合は、None(NULL)になります。

In [0]:
select * from meibo a left join score b on a.id=b.id;

,id,name,class,age,height,id,math,english,science
0,1,Yamada,1,14,150,1,10,10,40
1,2,Tanaka,2,13,150,2,None,60,100
2,3,Suzuki,1,13,150,3,30,40,60
3,4,Kato,2,15,150,None,None,None,None
4,5,Ito,3,12,155,5,25,31,10
5,6,Takeuchi,2,16,155,6,50,30,10
6,7,Kimura,3,11,160,None,None,None,None
7,8,Sato,1,14,160,8,90,100,90

以下は、参考ですが、自分自身のテーブルと結合をする自己結合も可能です。どんな活用方法があるかは次の章で解説します。

In [0]:
select * from meibo a join meibo b on a.id=b.id;

,id,name,class,age,height,id,name,class,age,height
0,1,Yamada,1,14,150,1,Yamada,1,14,150
1,2,Tanaka,2,13,150,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150,3,Suzuki,1,13,150
3,4,Kato,2,15,150,4,Kato,2,15,150
4,5,Ito,3,12,155,5,Ito,3,12,155
5,6,Takeuchi,2,16,155,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160,7,Kimura,3,11,160
7,8,Sato,1,14,160,8,Sato,1,14,160

>**[ポイント]**

>union：重複を除いた結合

>union all：重複ありの結合

>inner join：内部結合

>left outer join：外部結合

#### <練習問題 1>

新しくcardtbというテーブルを作成してください。ただし、カラムはid,point,money (すべてint)にしてください。さらに、以下のデータを挿入してください。<br>(id,point,money) = (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100)

#### <練習問題 2>

meiboテーブルにidをキーとして、上記のテーブルを内部結合させてください。

#### <練習問題 3>
meiboテーブルにidをキーとして、上記のテーブルを外部結合させてください。

### 8.2.6 case文とサブクエリ
キーワード：case文、サブクエリ

データを処理していると、条件分岐をし、それぞれを集計したいという場合があります。SQLでは条件分岐処理もできます。以下では、クラス番号が「1,2,3」ならば、それぞれ「A,B,C」というクラス名(className)が付与されるようにしています。

In [0]:
select 
     id, name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

,id,name,className
0,1,Yamada,A
1,2,Tanaka,B
2,3,Suzuki,A
3,4,Kato,B
4,5,Ito,C
5,6,Takeuchi,B
6,7,Kimura,C
7,8,Sato,A

次は「サブクエリ」といいます。サブクエリを使用すると、元となるテーブルから必要な情報を取り出し、さらにそれをテーブルとして取り扱うことができます。この例ではmeiboテーブルの内容をサブクエリを用いてテーブルbとして扱っています。

In [0]:
select b.name,b.age from 
 (select a.age,a.name from meibo a where a.class = 1) b;

,name,age
0,Yamada,14
1,Suzuki,13
2,Sato,14

なお、上記はカラム名を指定していますが、全てのカラムをもってきたい場合は、エイリアス名の後にドットアスタリスク（.*）をつけます。

In [0]:
select b.* from 
 (select a.* from meibo a where a.class = 1) b;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,3,Suzuki,1,13,150
2,8,Sato,1,14,160

以上で、SQLの基礎的な操作は完了です。練習問題の後は、ビューについて学びます。

>**[ポイント]**

>case when 条件 then A else B end as カラム名設定：条件分岐

#### <練習問題 1>

meiboテーブルで、heightが155未満の場合は"below_155"、155ぴったりならば"equal_155"、155より大きいならば"over_155"と名付けて、テーブルを表示させてください。

#### <練習問題 2>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevelの人数を求めてください。

#### <練習問題 3>
上記のテーブルとサブクエリの考え方を利用して、それぞれのheightLevelの平均年齢を求めてください。

## 8.3 ビュー
ゴール：ビューの概念を理解し、作成や操作ができる

### 8.3.1 ビュー
キーワード：ビュー

次は、ビューについて学びます。これまでは、直接テーブルからデータを問い合わせて、必要な情報を取得していましたが、毎回条件を設定して各テーブルからデータを抽出するのは、少し面倒です。とはいえ、必要な情報を各テーブルから取得したテーブルを作成したとしても、元データの更新のたびにそのテーブルも更新する必要があるので、やはり面倒です。このようなとき、ビューを活用することで、常に最新のデータを簡単に抽出することができるようになります。ビューは、あらかじめ検索する方法を記録させておく仮想のテーブルです。

ビューの作成方法はテーブルとほぼ同じで、create viewを使います。まずは、簡単な例からみていきましょう。meiboテーブルから、idとnameだけを持ってくるビューを作成しています。

In [0]:
create view v1
    as
select id,name
    from meibo;

新しいビューができているか見てみましょう。やり方は以前学んだ方法と同じです。

In [0]:
select * from v1;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki
3,4,Kato
4,5,Ito
5,6,Takeuchi
6,7,Kimura
7,8,Sato

これだけだとあまりビューの便利さわからないので、次の例を見てみましょう。前に作成した少し複雑なテーブルもビューを作成しておけば、いつでも呼び出すことができます。

In [0]:
create view v2
    as
select 
     id
    ,name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

以下のビューを設定しておけば、欲しい検索結果を以下のようなSQL文だけで呼び出すことができます。

In [0]:
select * from v2;

,id,name,className
0,1,Yamada,A
1,2,Tanaka,B
2,3,Suzuki,A
3,4,Kato,B
4,5,Ito,C
5,6,Takeuchi,B
6,7,Kimura,C
7,8,Sato,A

ビューを更新することもできます。試しに以下のデータを挿入してみましょう。

In [0]:
insert into v1 (id, name) values (100, "dummy_Yamada");
insert into v1 (id, name) values (200, "dummy_Tanaka");
insert into v1 (id, name) values (300, "dummy_Sato");

In [0]:
select * from v1;

,id,name
0,1,Yamada
1,2,Tanaka
2,3,Suzuki
3,4,Kato
4,5,Ito
5,6,Takeuchi
6,7,Kimura
7,8,Sato
8,100,dummy_Yamada
9,200,dummy_Tanaka
10,300,dummy_Sato

ただし、ビューを更新すると、元の参照テーブルも変更されるので、注意してください。

In [0]:
select * from meibo;

,id,name,class,age,height
0,1,Yamada,1,14,150
1,2,Tanaka,2,13,150
2,3,Suzuki,1,13,150
3,4,Kato,2,15,150
4,5,Ito,3,12,155
5,6,Takeuchi,2,16,155
6,7,Kimura,3,11,160
7,8,Sato,1,14,160
8,100,dummy_Yamada,None,None,None
9,200,dummy_Tanaka,None,None,None
10,300,dummy_Sato,None,None,None

ビューを更新するときは、元のテーブルへの影響範囲を十分に考え、注意しましょう。ただし、ビューが更新できないこともありますので、練習問題で見てみることにします。

以下のコマンドで、ビューであることわかります。

In [0]:
show table status;

,Name,Engine,Version,Row_format,Rows,Avg_row_length,Data_length,Max_data_length,Index_length,Data_free,Auto_increment,Create_time,Update_time,Check_time,Collation,Checksum,Create_options,Comment
0,cardtb,MyISAM,10,Fixed,6,13,78,3659174697238527,2048,0,None,2017-12-20 10:33:53,2017-12-20 10:37:18,None,utf8_general_ci,None,,
1,meibo,MyISAM,10,Dynamic,11,38,424,281474976710655,2048,0,None,2017-12-20 10:28:35,2017-12-20 10:39:56,None,utf8_general_ci,None,,
2,meibo2,MyISAM,10,Dynamic,5,28,144,281474976710655,2048,0,None,2017-12-20 10:32:37,2017-12-20 10:36:03,None,utf8_general_ci,None,,
3,score,MyISAM,10,Fixed,9,17,153,4785074604081151,2048,0,None,2017-12-20 10:33:05,2017-12-20 10:36:28,None,utf8_general_ci,None,,
4,v1,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,VIEW
5,v2,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,VIEW

#### <練習問題 1>
テーブルmeibo2からidとnameを取り出して、ビューのv3を作成してみましょう。

#### <練習問題 2>
meiboテーブルとscoreテーブルを内部結合して、idとnameを取り出すビューv4を作成してみましょう。

#### <練習問題 3>
上記で作成したテーブルに新しいデータを追加してみましょう。どうなりますか？

***

## 8.4 総合問題

### 8.4.1 総合問題1

以下のデータベースを使って、後の問いに答えてください。(以下のURLにある注意事項等も参照ください。)

https://dev.mysql.com/doc/world-setup/en/

データベースをインストールする方法は以下のコマンドを実行してください(**ただし、terminal上で実行する必要があります。**terminalはJupyterのトップ画面から、右上にある「New」をクリックすると表示されます。手順としては、mkdirでフォルダ（chapter8など）を作成した後に、以下のコマンドを実行し、エラーがないことを確認したら、ここへ戻ってデータベースがあることを確認し、問題に取り組んでください。なお、このページの上にある「Kernel」をクリックし、Change kernelでPythonに変更して実行しても大丈夫です。ただし、sqlを実行する場合は、Kernelをsqlに戻してください。)。

-------------------
wget http://downloads.mysql.com/docs/world.sql.gz  
gzip -d world.sql.gz  
mysql -h"zdb" -P"3306" -u root -p"gci" < world.sql    

-------------------

(1) データベースworldを選択して、どのようなテーブルがあるか、またそれぞれどのようなカラムがあるか表示してください。  
(2) それぞれのテーブルについて、それぞれ5行ずつ表示させてください。どんなデータがあるか軽く確認してください。  
(3) cityテーブルについて、レコード数をカウントしてください。また、重複するデータがあるかどうか、チェックしてください。

### 8.4.2 総合問題2
上記と同じデータベースを使って、以下の問いに答えてください。

(1) countrylanguageテーブルについて、それぞれのCountryCodeを軸に、言語の数（テーブルにあるものだけ、重複なく）を計算してください。また、その結果をcityテーブルに紐付けて（joinして）、cityのカラム全てとその言語の数を表示してください。ただし、結果は5行のみ表示させるだけでよいです。  
(2)  countrylanguageテーブルについて、それぞれのCountryCodeを軸に、Percentageを合計してください。ただし、その合計値が99.9を超えるものだけ表示させるようにしてください。  
(3)  cityテーブルについて、DistrictのイニシャルがAではじまるもの、Bではじまるもの、Cではじまるもの、その他(others)の4パターンに分けて、それぞれのレコード数をカウントしてください。